[
  {
    "Id": 1,
    "title": "System Maintenance Scheduled for Weekend",
    "message": "Our member portal will undergo scheduled maintenance this Saturday from 2:00 AM to 6:00 AM EST. During this time, the portal will be temporarily unavailable. All services will be fully restored by 6:00 AM on Saturday.\n\nWe apologize for any inconvenience and appreciate your patience as we work to improve our systems and services.",
    "type": "announcement",
    "attachments": [],
    "createdAt": "2024-01-15T07:30:00Z"
  },
  {
    "Id": 2,
    "title": "Urgent: Security Protocol Update Required",
    "message": "All member organizations must update their security protocols by January 31st to comply with new cybersecurity requirements. This includes implementing two-factor authentication for all portal access and updating password policies.\n\nDetailed instructions and support resources are available in the member portal under the Security section. Please contact our IT support team if you need assistance with implementation.",
    "type": "alert",
    "attachments": [
      {
        "name": "security-update-guide.pdf",
        "size": 1456000,
        "type": "application/pdf",
        "url": "#"
      }
    ],
    "createdAt": "2024-01-14T09:15:00Z"
  },
  {
    "Id": 3,
    "title": "Member Directory Update Reminder",
    "message": "This is a friendly reminder to update your organization's information in the member directory. Please review and update your contact information, business description, and service offerings to ensure accuracy.\n\nUpdated directory information helps other members find and connect with your organization for potential collaboration opportunities.",
    "type": "reminder",
    "attachments": [],
    "createdAt": "2024-01-12T13:45:00Z"
  },
  {
    "Id": 4,
    "title": "New Member Onboarding Process",
    "message": "We've streamlined our new member onboarding process to provide a better experience for organizations joining our trade community. The new process includes digital document submission, virtual orientation sessions, and dedicated support throughout the first 90 days.\n\nExisting members can refer new organizations using our updated referral system, which now includes enhanced tracking and rewards.",
    "type": "general",
    "attachments": [
      {
        "name": "onboarding-overview.pdf",
        "size": 890000,
        "type": "application/pdf",
        "url": "#"
      },
      {
        "name": "referral-program.docx",
        "size": 645000,
        "type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document",
        "url": "#"
      }
    ],
    "createdAt": "2024-01-10T16:20:00Z"
  },
  {
    "Id": 5,
    "title": "Committee Meeting Schedule Published",
    "message": "The schedule for all committee meetings through Q2 2024 has been published in the member portal. Committee chairs have been notified, and meeting invitations will be sent to relevant committee members.\n\nIf you're interested in joining a committee or have questions about committee participation, please contact our member services team.",
    "type": "general",
    "attachments": [
      {
        "name": "committee-schedule-q2.pdf",
        "size": 567000,
        "type": "application/pdf",
        "url": "#"
      }
    ],
    "createdAt": "2024-01-08T11:30:00Z"
  }
]